Podkova/src/DataProcessors/ЗаполнениеКорректировкиНазначения/ЗаполнениеКорректировкиНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеКорректировкиНазначения</name>
</mdclass:DataProcessor>

Podkova/src/Enums/ВидыОперацийКорректировкиНазначения/ВидыОперацийКорректировкиНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКорректировкиНазначения</name>
  <enumValues>
    <name>СнятьРезерв</name>
  </enumValues>
  <enumValues>
    <name>СнятьРезервПоМногимНазначениям</name>
  </enumValues>
  <enumValues>
    <name>Резервировать</name>
  </enumValues>
  <enumValues>
    <name>РезервироватьИКорректировать</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяКорректировкаНазначений</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Documents/КорректировкаНазначенияТоваров/КорректировкаНазначенияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаНазначенияТоваров</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.ЗаказНаСборку</basedOn>
  <basedOn>Document.ЗаказНаПеремещение</basedOn>
  <basedOn>Document.ЗаказНаВнутреннееПотребление</basedOn>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииНДСКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураНоменклатура</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыЗапасовУказаныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКорректировкиНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоРаспоряжению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.СкладскиеПомещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеНазначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеНазначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеНазначениеДвиженияПоСкладскимРегистрам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатурыОприходование</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатурыОприходование</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасовОприходование</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьНазначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьНовоеНазначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОрганизация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеНазначениеПустое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Podkova/src/DataProcessors/ЗаполнениеКорректировкиНазначения/Forms/ФормаОбъекта/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Проверка возможности открытия формы /отказ от открытия формы.
	Если Не Параметры.Свойство("Назначение") 
		И Не Параметры.Свойство("Заказ") Тогда
		ТекстИсключения = НСтр("ru = 'Форма не предназначена для непосредственного открытия.'");
		ВызватьИсключение ТекстИсключения;
		Возврат;
	КонецЕсли;
	
	СнятиеРезерва = Параметры.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв
		Или Параметры.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям;
	
	ВидОперации = Параметры.ВидОперации;
	
	Если Параметры.Свойство("Назначение") Тогда
		Назначение = Параметры.Назначение;
		Заказ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Назначение, "Заказ");
	Иначе
		Заказ = Параметры.Заказ;
		Назначение = Документы.КорректировкаНазначенияТоваров.НазначениеЗаказа(Заказ);
	КонецЕсли;
	
	
	Если Параметры.Свойство("КорректировкаНазначения") Тогда
		КорректировкаНазначения = Параметры.КорректировкаНазначения;
	КонецЕсли;
	
	Если Параметры.Свойство("УникальныйИдентификаторДляВременногоХранилища") Тогда
		УникальныйИдентификаторДляВременногоХранилища = Параметры.УникальныйИдентификаторДляВременногоХранилища;
	Иначе
		УникальныйИдентификаторДляВременногоХранилища = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		
		Организация = Параметры.Организация;
		Если Параметры.Свойство("Мастер") И Параметры.Мастер И ЗначениеЗаполнено(Заказ) Тогда
			Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Организация");
		КонецЕсли;
		
	КонецЕсли;
	
	ТолькоЗаказыОрганизации = ЗначениеЗаполнено(Организация)
		И(ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать
			Или ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям);
	
	ЗадатьЗначенияПоУмолчанию();
	
	НастроитьЭлементыФормыПриСоздании();
	
	ЗаполнитьТаблицу();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТолькоЗаказыОрганизацииПриИзменении(Элемент)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЗаполнениеКорректировкиНазначения.ФормаОбъекта.Элемент.ТолькоЗаказыОрганизации.ПриИзменении");
	
	ЗаполнитьТаблицу();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаТовары

&НаКлиенте
Процедура ТаблицаТоварыСтрокаВыбранаПриИзменении(Элемент)
	
	СформироватьИнформационнуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаТовары.ТекущиеДанные;
	ТекущаяСтрока.Отметка = ТекущаяСтрока.Количество > 0;
	
	СформироватьИнформационнуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЗаполнениеКорректировкиНазначения.ФормаОбъекта.Элемент.ТаблицаТовары.ПриАктивизацииСтроки");
	
	ПодключитьОбработчикОжидания("СформироватьИнформационнуюСтроку", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваПомещенияИЯчейки

&НаКлиенте
Процедура ДеревоПомещенияЯчейкиКоличествоВетвьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоПомещенияЯчейки.ТекущиеДанные;
	
	СтруктураПересчетаЕдиниц = Новый Структура();
	СтруктураПересчетаЕдиниц.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураПересчетаЕдиниц, Неопределено);
	
	ТекущаяСтрока.Отметка = ТекущаяСтрока.Количество > 0;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВидОперацииПереключательПриИзменении(Элемент)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЗаполнениеКорректировкиНазначения.ФормаОбъекта.Элемент.ВидОперацииПереключатель.ПриИзменении");
	
	ВидОперацииПереключательПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтроки(Команда)
	
	ОтметитьСтроки(Истина);
	
	СформироватьИнформационнуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьСтроки(Команда)
	
	ОтметитьСтроки(Ложь);
	
	СформироватьИнформационнуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЗаполнениеКорректировкиНазначения.ФормаОбъекта.Элемент.ОтборРезервированияПоСкладуОтгрузки.ПриИзменении");
	
	РежимПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЗаполнениеКорректировкиНазначения.ФормаОбъекта.Команда.Далее");
	
	СтруктураВозврата = ДалееНаСервере();
	СтруктураСозданияДокумента = СтруктураВозврата.СтруктураСозданияДокумента;
	
	Если СтруктураВозврата.СменаСтраницы Тогда
		
		Для Каждого Строка Из ДеревоПомещенияЯчейки.ПолучитьЭлементы() Цикл
			Элементы.ДеревоПомещенияЯчейки.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
		
	ИначеЕсли Параметры.Мастер И ЗначениеЗаполнено(СтруктураСозданияДокумента.Ошибка) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураСозданияДокумента.Ошибка);
		
	Иначе
		
		Если ЗначениеЗаполнено(СтруктураСозданияДокумента) И Параметры.Мастер Тогда
			Если СтруктураСозданияДокумента.Проведен Тогда
				НавигационнаяСсылкаДокумента = ПолучитьНавигационнуюСсылку(СтруктураСозданияДокумента.Документ);
				ПоказатьОповещениеПользователя(НСтр("ru = 'Создана корректировка назначения товаров'"), НавигационнаяСсылкаДокумента, СтруктураСозданияДокумента.Документ);
				Закрыть();
			КонецЕсли;
		Иначе
			
			ЕстьИзмененияКоличества = Ложь;
			АдресВХранилище = ПоместитьТоварыВХранилище(ЕстьИзмененияКоличества);
			ОповеститьОВыборе(Новый Структура("ТаблицаТовары, ВидОперации", АдресВХранилище, ВидОперации));
			
			Если ЕстьИзмененияКоличества Тогда
				ПоказатьОповещениеПользователя(НСтр("ru = 'Количество скорректировано'"),,
					НСтр("ru = 'Из указанного количества к снятию резерва исключены давальческие материалы'"),
					БиблиотекаКартинок.Информация32);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Если Элементы.Шаги.ТекущаяСтраница = Элементы.ШагПоСкладам Тогда
		
		Если Модифицированность Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОтменаЗавершение", ЭтотОбъект), НСтр("ru='Закрыть мастер создания корректировки назначения товаров?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			Закрыть();
		КонецЕсли;
		
	ИначеЕсли Элементы.Шаги.ТекущаяСтраница = Элементы.ШагПоПомещениямЯчейкам Тогда
		Элементы.Шаги.ТекущаяСтраница = Элементы.ШагПоСкладам;
	Иначе
		Закрыть();
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьРезервыСверхПотребностей(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЗаполнениеКорректировкиНазначения.ФормаОбъекта.Команда.СнятьРезервыСверхПотребности");
	
	СнятьРезервыСверхПотребностейСервер();
	СформироватьИнформационнуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеРезервы(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ЗаполнениеКорректировкиНазначения.ФормаОбъекта.Команда.СнятьВсеРезервы");
	
	СнятьВсеРезервыСервер();
	СформироватьИнформационнуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОтметкаПриИзменении(Элемент)
	
	СтруктураОтбора = Новый Структура();
	
	Если ФильтрОтметка Тогда
		СтруктураОтбора.Вставить("Отметка", Истина);
	КонецЕсли;
	
	Элементы.ТаблицаТовары.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КомандыФормыПродолжение

&НаСервере
Процедура СнятьРезервыСверхПотребностейСервер()
	
	Документы.КорректировкаНазначенияТоваров.СнятьРезервы(ТаблицаТовары, Истина);
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура СнятьВсеРезервыСервер()
	
	Документы.КорректировкаНазначенияТоваров.СнятьРезервы(ТаблицаТовары, Ложь);
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция СоздатьДокумент()
	
	СтруктураСозданияДокумента = Новый Структура("Документ, Проведен, Ошибка");
	
	Документ = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
	
	Документ.Назначение = Назначение;
	Документ.ВидОперации = ВидОперации;
	
	Если ЗначениеЗаполнено(Заказ) Тогда
		Документ.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Организация");
	КонецЕсли;
	
	МассивСтрок = Новый Массив();
	
	Для Каждого Строка Из ТаблицаТовары Цикл
		Если Строка.Количество > 0 И Строка.Отметка Тогда
			МассивСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	ТоварыКПереносу = ТаблицаТовары.Выгрузить(МассивСтрок);
	
	Если ТоварыКПереносу.Количество() > 0 Тогда
		
		Документы.КорректировкаНазначенияТоваров.ПостобработкаТаблицыТовары(ТоварыКПереносу, ВидОперации, Организация);
		
		Документ.Товары.Загрузить(ТоварыКПереносу);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить(
			"ПересчитатьКоличествоУпаковок",
			ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаКоличестваУпаковок());
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Документ.Товары, СтруктураДействий, Неопределено);
		
		ПараметрыУказанияСерий = Документы.КорректировкаНазначенияТоваров.ПараметрыУказанияСерий(Документ);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Документ, ПараметрыУказанияСерий);
		
		Документ.Дата = ТекущаяДатаСеанса();
		Документ.УстановитьНовыйНомер();
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			СтруктураСозданияДокумента.Проведен = Истина;
		Исключение
			
			// Пользователю выведены ошибки проведения документа. Однако документ не записан в БД.
			// При двойном клике на ошибку будет показана форма нового документа (пустая) "Корректировка назначения товаров".
			// В целях предоставления пользователю ошибок, при двойном клике на которые откроется заполненный нужными данными
			// документ, сначала производится запись, и затем попытка проведения, которая выведет список ошибок,
			// на этот раз привязанных к существующему в БД документу.
			
			ПолучитьСообщенияПользователю(Истина); // Очистка сообщений об ошибках выведенных при первом проведении
			
			Документ.Записать(РежимЗаписиДокумента.Запись);
			Попытка
				Документ.Записать(РежимЗаписиДокумента.Проведение);
				СтруктураСозданияДокумента.Проведен = Истина;
			Исключение
				СтруктураСозданияДокумента.Проведен = Ложь;
			КонецПопытки;
			
		КонецПопытки;
		
		СтруктураСозданияДокумента.Документ = Документ.Ссылка;
		
	Иначе
		СтруктураСозданияДокумента.Ошибка = НСтр("ru = 'Не выбрано ни одной строки. Создание документа невозможно.'");
	КонецЕсли;
	
	Возврат СтруктураСозданияДокумента;
	
КонецФункции

&НаСервере
Процедура ПеренестиДанныеДереваВТаблицу()
	
	СтруктураПоиска = Новый Структура("ИсходноеНазначение, Номенклатура, Характеристика, Склад");
	
	Для Каждого Корень Из ДеревоПомещенияЯчейки.ПолучитьЭлементы() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Корень);
		СтруктураПоиска.ИсходноеНазначение = Корень.Назначение;
		
		Ветви = Корень.ПолучитьЭлементы();
		
		Если Ветви.Количество() > 0 Тогда
			НайденныеСтроки = ТаблицаТовары.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если Ветви.Количество() > 1 Тогда
					
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						ТаблицаТовары.Удалить(НайденнаяСтрока);
					КонецЦикла;
					
					Для Каждого Ветвь Из Ветви Цикл
						
						Если Ветвь.Отметка И Ветвь.Количество > 0 Тогда
							НоваяСтрока = ТаблицаТовары.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Ветвь, "Помещение, Ячейка, Серия, Упаковка, Количество, Отметка");
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					НайденнаяСтрока = НайденныеСтроки[0];
					НайденнаяВетвь = Ветви[0];
					
					ЗаполнитьЗначенияСвойств(НайденнаяСтрока, НайденнаяВетвь, "Помещение, Ячейка, Серия, Упаковка, Количество, Отметка");
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакТребованияПомещенияИЯчейки()
	
	// ТаблицаТовары не имеет номера строки, а так же других полей, создаем таблицу для проведения расчетов.
	ТаблицаТоварыСИндексами = ТаблицаТовары.Выгрузить(, "Номенклатура, ИсходноеНазначение, НовоеНазначение, Склад");
	ТаблицаТоварыСИндексами.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаТоварыСИндексами.Колонки.Добавить("СтатусУказанияСерий", Новый ОписаниеТипов("Число"));
	ТаблицаТоварыСИндексами.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	// Заполнение номера строки для расчетов, и последующей связи с ТаблицаТовары
	НомерСтроки = 0;
	Для Каждого Строка Из ТаблицаТоварыСИндексами Цикл
		НомерСтроки = НомерСтроки + 1;
		Строка.НомерСтроки = НомерСтроки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	ТекстЗапросаТаблицаТоваров =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки,
	|	ТаблицаТоваров.Склад КАК Склад
	|ПОМЕСТИТЬ СтрокиТаблицы
	|ИЗ
	|	&Товары КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки,
	|	ТаблицаТоваров.Склад,
	|	ЕстьNULL(СкладскиеПомещения.Ссылка, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) КАК Помещение
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	СтрокиТаблицы КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладскиеПомещения КАК СкладскиеПомещения
	|		ПО ТаблицаТоваров.Склад = СкладскиеПомещения.Владелец
	|		И СкладскиеПомещения.ПометкаУдаления = ЛОЖЬ";
	
	// Определение использования помещений по складам и адресного хранения
	// + Определение использования серий по складам.
	ТекстОкончанияЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.НомерСтроки,
	|	МАКСИМУМ(Таблица.ИспользоватьАдресноеХранение) КАК ИспользоватьАдресноеХранение,
	|	МАКСИМУМ(Таблица.ИспользоватьСкладскиеПомещения) КАК ИспользоватьСкладскиеПомещения,
	|	МАКСИМУМ(ВЫБОР КОГДА ЕСТЬNULL(ТаблицаСтатусов.СтатусУказанияСерий, 0) > 0 ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ) КАК ИспользованиеСерийПоСкладу
	|ИЗ
	|	ВТИспользованиеПомещенийИАдресногоХранения КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтатусов КАК ТаблицаСтатусов
	|		ПО Таблица.НомерСтроки = ТаблицаСтатусов.НомерСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.НомерСтроки";
	
	ТекстЗапроса = ТекстЗапросаТаблицаТоваров 
		+ ТекстРазделителяЗапросов()
		+ Документы.КорректировкаНазначенияТоваров.ТекстЗапросаИспользованиеПомещенийИАдресногоХранения("ВТИспользованиеПомещенийИАдресногоХранения")
		+ ТекстРазделителяЗапросов()
		+ Документы.КорректировкаНазначенияТоваров.ТекстЗапросаЗаполненияСтатусовУказанияСерий(Неопределено)
		+ ТекстРазделителяЗапросов()
		+ ТекстОкончанияЗапроса;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Товары", ТаблицаТоварыСИндексами);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Помещение результата расчетов использования серий, помещений и адресного хранения.
	Пока Выборка.Следующий() Цикл
		
		Строка = ТаблицаТовары[Выборка.НомерСтроки - 1];
		
		Если Выборка.ИспользоватьСкладскиеПомещения
			Или Выборка.ИспользоватьАдресноеХранение 
			Или Выборка.ИспользованиеСерийПоСкладу Тогда
			
			Строка.ТребуетсяШаг2 = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяШаг2()
	
	Для Каждого Строка Из ТаблицаТовары Цикл
		Если Строка.ТребуетсяШаг2 И Строка.Отметка И Строка.Количество > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПоместитьТоварыВХранилище(ЕстьИзмененияКоличества)
	
	МассивСтрок = Новый Массив();
	
	Для Каждого Строка Из ТаблицаТовары Цикл
		Если Строка.Количество > 0 И Строка.Отметка Тогда
			 МассивСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	ТоварыКПереносу = ТаблицаТовары.Выгрузить(МассивСтрок);
	
	ЕстьИзмененияКоличества = Документы.КорректировкаНазначенияТоваров.ПостобработкаТаблицыТовары(ТоварыКПереносу,
		ВидОперации, Организация, КорректировкаНазначения);
	
	Результат = Новый Структура("Товары", ТоварыКПереносу);
	АдресВХранилище = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификаторДляВременногоХранилища);
	Возврат АдресВХранилище;

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма, "ДеревоПомещенияЯчейкиЕдиницаИзмерения", "ДеревоПомещенияЯчейки.Упаковка");
	
	//
	
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма, "ТоварыНоменклатураЕдиницаИзмерения", "ТаблицаТовары.Упаковка");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиЗаказ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиНоменклатура.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиХарактеристика.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиЗаказИсточник.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиСклад.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиКоличество.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиКоличествоВетвь1.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоПомещенияЯчейки.ЭтоКорень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиСерия.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиПомещение.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиЯчейка.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиОтметка.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиКоличествоВетвь.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоПомещенияЯчейки.ЭтоКорень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиЗаказ.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиНоменклатура.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиХарактеристика.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиЗаказИсточник.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиСклад.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиКоличество.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиКоличествоВетвь1.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоПомещенияЯчейки.ЭтоКорень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиСерия.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиПомещение.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиЯчейка.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиОтметка.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоПомещенияЯчейкиКоличествоВетвь.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоПомещенияЯчейки.ЭтоКорень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИнформационнуюСтроку()
	
	Строка = Элементы.ТаблицаТовары.ТекущиеДанные;
	
	Если Строка <> Неопределено Тогда
		
		СформироватьИнформационнуюСтрокуСервер(Строка.Назначение);
		
		СтрокаИтогов = ИтогиЗаказа.НайтиПоИдентификатору(Строка.ИдентификаторСтрокиИтогов);
		
		ИтогиСклад = "";
		
		Если СтрокаИтогов <> Неопределено Тогда
			
			ИтогиСклад = ?(ИспользоватьНесколькоСкладов, Строка(СтрокаИтогов.Склад), "");
			
			ИтогиПотребность = СтрокаИтогов.Потребность;
			ИтогиОбеспечено = СтрокаИтогов.Обеспечено + СтрокаИтогов.Количество;
			ИтогиНаСкладе = СтрокаИтогов.НаСкладе + СтрокаИтогов.Количество;
			
			Если ИтогиОбеспечено < 0 Или ИтогиОбеспечено > ИтогиПотребность Тогда
				Элементы.ИтогиОбеспечено.ЦветТекста = ЦветОтрицательногоЧисла;
			Иначе
				Элементы.ИтогиОбеспечено.ЦветТекста = ЦветТекстаПоля;
			КонецЕсли;
			
			Если ИтогиНаСкладе < 0 Или ИтогиНаСкладе > ИтогиПотребность Тогда
				Элементы.ИтогиНаСкладе.ЦветТекста = ЦветОтрицательногоЧисла;
			Иначе
				Элементы.ИтогиНаСкладе.ЦветТекста = ЦветТекстаПоля;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаголовокКлючСтроки = Строка(Строка.Номенклатура)
			+ Строка(?(ЗначениеЗаполнено(Строка.Характеристика), ", " + Строка.Характеристика, "")
			+ ?(ЗначениеЗаполнено(ИтогиСклад), ", " + ИтогиСклад, ""));
		
		ИтогиАналитикаНоменклатуры = ЗаголовокКлючСтроки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИнформационнуюСтрокуСервер(НазначениеДляИтога)
	
	ПерезаполнитьКоличествоВТаблицеИтогов();
	РассчитатьИтогиПоЗаказу(НазначениеДляИтога);
	
	УстановитьДоступностьИЗаголовокКнопокОтменаДалее();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	СнятиеРезерва = ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв
		Или ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям;
		
	СнятьРезервВсехДокументов = ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям;
	
	ТаблицаЗаполнена = ТаблицаТовары.Количество() > 0;
	
	Если СнятиеРезерва И Не ТаблицаЗаполнена И Не ЕстьДоступныйРезервОстаток Тогда
		
		Элементы.Шаги.ТекущаяСтраница = Элементы.НетДанных;
		Элементы.Далее.Видимость = Ложь;
		Элементы.Отмена.КнопкаПоУмолчанию = Истина;
		Элементы.ТекстБудетСозданаКорректировка.Видимость = Ложь;
		
	ИначеЕсли Не СнятиеРезерва И Не ЕстьДоступныйРезервОстаток Тогда
		
		Элементы.ГруппаДанныеТаблицыТовары.ТекущаяСтраница = Элементы.НетДанныхДляРезервирования;
		
		Элементы.ГруппаКоманднаяПанель.Доступность = Ложь;
		Элементы.ФильтрОтметка.Доступность = Ложь;
		Элементы.ТаблицаТоварыВыбратьТовары1.Доступность = Ложь;
		Элементы.ТаблицаТоварыИсключитьТовары1.Доступность = Ложь;
		Элементы.ТаблицаТоварыНайти1.Доступность = Ложь;
		Элементы.ТаблицаТоварыОтменитьПоиск1.Доступность = Ложь;
		Элементы.ТаблицаТоварыВывестиСписок.Доступность = Ложь;
		
		Элементы.Далее.Видимость = Ложь;
		Элементы.Отмена.КнопкаПоУмолчанию = Истина;
		Элементы.ТекстБудетСозданаКорректировка.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаДанныеТаблицыТовары.ТекущаяСтраница = Элементы.ГруппаТаблицаТовары;
		
		Элементы.ГруппаКоманднаяПанель.Доступность = Истина;
		Элементы.ФильтрОтметка.Доступность = Истина;
		Элементы.ТаблицаТоварыВыбратьТовары1.Доступность = Истина;
		Элементы.ТаблицаТоварыИсключитьТовары1.Доступность = Истина;
		Элементы.ТаблицаТоварыНайти1.Доступность = Истина;
		Элементы.ТаблицаТоварыОтменитьПоиск1.Доступность = Истина;
		Элементы.ТаблицаТоварыВывестиСписок.Доступность = Истина;
		
		Если СнятиеРезерва Тогда
			Элементы.ВидОперацииПереключатель.Видимость = Ложь;
			Элементы.ДеревоПомещенияЯчейкиРезерв.Заголовок = НСтр("ru = 'Резерв'");
		Иначе
			Элементы.ВидОперацииПереключатель.Видимость = Истина;
			Элементы.ДеревоПомещенияЯчейкиРезерв.Заголовок = НСтр("ru = 'Доступно'");
		КонецЕсли;
		
		УстановитьДоступностьИЗаголовокКнопокОтменаДалее();
		
		Если Документы.КорректировкаНазначенияТоваров.КонтролироватьПревышениеПотребностиПоЗаказу(Назначение) Тогда
			Элементы.СнятьРезервыСверхПотребностей.Видимость = Ложь;
			Элементы.ОтборРезервированияПоСкладуОтгрузки.Видимость = Ложь;
			Если Не СнятиеРезерва Тогда
				Элементы.СнятьВсеРезервы.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов") Тогда
			Элементы.ОтборРезервированияПоСкладуОтгрузки.Видимость = Ложь;
			Если Не СнятиеРезерва Тогда
				Элементы.ГруппаПереключатели.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Пользователи.РолиДоступны("ДополнительныеОперацииКорректировкиНазначенияТоваров") Тогда
			Элементы.ВидОперацииПереключатель.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьИЗаголовокКнопокОтменаДалее()
	
	КомандаОтмена = Команды.Найти("Отмена");
	КомандаДалее = Команды.Найти("Далее");
	
	ТекстНазад = НСтр("ru = 'Назад'");
	ТекстОтмена = НСтр("ru = 'Отмена'");
	
	ТекстДалее = НСтр("ru = 'Далее'");
	ТекстСоздатьДокумент = НСтр("ru = 'Создать документ'");
	ТекстПеренестиВДокумент = НСтр("ru = 'Перенести в документ'");
	
	ТребуетсяШаг2 = ТребуетсяШаг2();
	
	// Процедура может быть вызвана только если ТЧ Товары доступна - в этом случае необходимо вернуть кнопку Далее
	// если ранее она была скрыта из-за отсутствия данных для заполнения.
	Если Не Элементы.Далее.Видимость Тогда
		Элементы.Далее.Видимость = Истина;
		Элементы.Далее.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Если ТребуетсяШаг2 И Элементы.Шаги.ТекущаяСтраница = Элементы.ШагПоСкладам Тогда
		Элементы.ТекстБудетСозданаКорректировка.Видимость = Ложь;
		КомандаДалее.Заголовок = ТекстДалее;
		КомандаДалее.Подсказка = ТекстДалее;
		КомандаОтмена.Заголовок = ТекстОтмена;
		КомандаОтмена.Подсказка = ТекстОтмена;
	ИначеЕсли Элементы.Шаги.ТекущаяСтраница = Элементы.ШагПоСкладам Тогда
		Если Параметры.Мастер Тогда
			Элементы.ТекстБудетСозданаКорректировка.Видимость = Истина;
			КомандаДалее.Заголовок = ТекстСоздатьДокумент;
			КомандаДалее.Подсказка = ТекстСоздатьДокумент;
		Иначе
			Элементы.ТекстБудетСозданаКорректировка.Видимость = Ложь;
			КомандаДалее.Заголовок = ТекстПеренестиВДокумент;
			КомандаДалее.Подсказка = ТекстПеренестиВДокумент;
		КонецЕсли;
		КомандаОтмена.Заголовок = ТекстОтмена;
		КомандаОтмена.Подсказка = ТекстОтмена;
	Иначе
		Если Параметры.Мастер Тогда
			Элементы.ТекстБудетСозданаКорректировка.Видимость = Истина;
			КомандаДалее.Заголовок = ТекстСоздатьДокумент;
			КомандаДалее.Подсказка = ТекстСоздатьДокумент;
		Иначе
			Элементы.ТекстБудетСозданаКорректировка.Видимость = Ложь;
			КомандаДалее.Заголовок = ТекстПеренестиВДокумент;
			КомандаДалее.Подсказка = ТекстПеренестиВДокумент;
		КонецЕсли;
		КомандаОтмена.Заголовок = ТекстНазад;
		КомандаОтмена.Подсказка = ТекстНазад;
	КонецЕсли;
	
	ДоступностьКнопкиДалее = ТаблицаТовары.Количество() > 0 Или ДеревоПомещенияЯчейки.ПолучитьЭлементы().Количество() > 0;
	Элементы.Далее.Доступность = ДоступностьКнопкиДалее;
	
КонецПроцедуры

&НаСервере
Процедура ЗадатьЗначенияПоУмолчанию()
	
	МогутБытьНазначенияБезЗаказа = Документы.КорректировкаНазначенияТоваров.ДопустимыНазначенияБезЗаказа();
	ИспользоватьНесколькоСкладов = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов");
	
	Если НЕ МогутБытьНазначенияБезЗаказа Тогда
		Элементы.ВидОперацииПереключатель.Заголовок = НСтр("ru = 'Использовать резервы других заказов'");
	КонецЕсли;
	
	ВидОперацииПереключатель = ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать;
	
	
	ЦветОтрицательногоЧисла = ЦветаСтиля.ЦветОтрицательногоЧисла;
	ЦветТекстаПоля = ЦветаСтиля.ЦветТекстаПоля;
	
	ЕстьДоступныйРезервОстаток = Документы.КорректировкаНазначенияТоваров.ЕстьДоступныйРезервОстаток(Назначение, Заказ, ВидОперации);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыПриСоздании()
	
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	Элементы.ТаблицаТоварыХарактеристика.Видимость = ИспользоватьХарактеристикиНоменклатуры;
	Элементы.ДеревоПомещенияЯчейкиХарактеристика.Видимость = ИспользоватьХарактеристикиНоменклатуры;
	
	РезервироватьИКорректировать = ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать;
	
	Элементы.ТолькоЗаказыОрганизации.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций")
		И (ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям
		Или РезервироватьИКорректировать);
	
	Элементы.ТолькоЗаказыОрганизации.Заголовок = СтрЗаменить(НСтр("ru = 'Только заказы организации ""%1""'"), "%1", Организация);
	
	Если ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв
		Или ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям Тогда
		
		Если МогутБытьНазначенияБезЗаказа Тогда
			Заголовок = СтрЗаменить(НСтр("ru = 'Снятие резерва (Назначение: %1)'"), "%1", Назначение);
		Иначе
			Заголовок = СтрЗаменить(НСтр("ru = 'Снятие резерва (%1)'"), "%1", Заказ);
		КонецЕсли;
		
		Элементы.ТаблицаТоварыКоличество.Заголовок = НСтр("ru = 'К снятию резерва'");
		
		Элементы.ДеревоПомещенияЯчейкиГруппаКоличествоВертикальная.Заголовок = НСтр("ru = 'К снятию резерва'");
		
		Если ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям Тогда
			
			Элементы.ТаблицаТоварыЗаказ.Видимость = Не МогутБытьНазначенияБезЗаказа;
			Элементы.ТаблицаТоварыИсходноеНазначение.Видимость = МогутБытьНазначенияБезЗаказа;
			
			Элементы.ДеревоПомещенияЯчейкиЗаказ.Видимость = Истина;
			
			Заголовок = НСтр("ru = 'Снятие резерва по многим назначениям'");
		КонецЕсли;
		
		Элементы.ГруппаПереключатели.ТекущаяСтраница = Элементы.ГруппаРежимСнятиеРезервов;
		Элементы.ВидОперацииПереключатель.Видимость = Ложь;
		
		НадписьСкладЗаказ = НСтр("ru = 'Склад'");
		НадписьСвободныйОстаток = НСтр("ru = 'Свободный остаток'");
		
	Иначе
		
		Если МогутБытьНазначенияБезЗаказа Тогда
			Заголовок = СтрЗаменить(НСтр("ru = 'Резервирование (Назначение: %1)'"), "%1", Назначение);
		Иначе
			Заголовок = СтрЗаменить(НСтр("ru = 'Резервирование (%1)'"), "%1", Заказ);
		КонецЕсли;
		
		Элементы.ТаблицаТоварыКоличество.Заголовок = НСтр("ru = 'К резервированию'");
		
		Элементы.ДеревоПомещенияЯчейкиГруппаКоличествоВертикальная.Заголовок = НСтр("ru = 'К резервированию'");
		
		Если РезервироватьИКорректировать И МогутБытьНазначенияБезЗаказа Тогда
			НадписьСкладЗаказ = НСтр("ru = 'Назначение, Склад'");
			НадписьСвободныйОстаток = НСтр("ru = 'Доступно'");
		ИначеЕсли РезервироватьИКорректировать И Не МогутБытьНазначенияБезЗаказа Тогда
			НадписьСкладЗаказ = НСтр("ru = 'Заказ, Склад'");
			НадписьСвободныйОстаток = НСтр("ru = 'Доступно'");
		Иначе
			НадписьСкладЗаказ = НСтр("ru = 'Склад'");
			НадписьСвободныйОстаток = НСтр("ru = 'Свободный остаток'");
		КонецЕсли;
		
		Элементы.ГруппаПереключатели.ТекущаяСтраница = Элементы.ГруппаРежимРезервирование;
		
		ВидОперацииПереключательВидимость = Истина;
		
		
		Элементы.ВидОперацииПереключатель.Видимость = ВидОперацииПереключательВидимость;
		
	КонецЕсли;
	
	Элементы.ТаблицаТоварыСкладЗаказИсточник.Заголовок = НадписьСкладЗаказ;
	Элементы.ТаблицаТоварыСкладЗаказИсточник.Подсказка = НадписьСкладЗаказ;
	
	Элементы.ТаблицаТоварыСкладЗаказИсточник.Видимость = ИспользоватьНесколькоСкладов 
		Или ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать;
	Элементы.ДеревоПомещенияЯчейкиСклад.Видимость = ИспользоватьНесколькоСкладов;
	Элементы.ДекорацияВНаличииНаСкладеОтгрузки.Видимость = ИспользоватьНесколькоСкладов;
	Элементы.ГруппаВНаличииНаСкладеОтгрузки.Видимость = ИспользоватьНесколькоСкладов;
	
	Элементы.ТаблицаТоварыСвободныйОстаток.Заголовок = НадписьСвободныйОстаток;
	Элементы.ТаблицаТоварыСвободныйОстаток.Подсказка = НадписьСвободныйОстаток;
	
	НадписьАналитика = НСтр("ru = 'Номенклатура, Характеристика, Заказ, Склад'");
	НадписьВетви = НСтр("ru = 'Серия, Помещение, Ячейка'");
	
	НадписьАналитика = ?(ИспользоватьХарактеристикиНоменклатуры, НадписьАналитика, СтрЗаменить(НадписьАналитика, ", Характеристика", ""));
	НадписьАналитика = ?(ИспользоватьНесколькоСкладов, НадписьАналитика, СтрЗаменить(НадписьАналитика, ", Склад", ""));
	
	Элементы.ДеревоПомещенияЯчейкиГруппировки.Заголовок = НадписьАналитика + " / " + НадписьВетви;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево()
	
	ЭлементыДерева = ДеревоПомещенияЯчейки.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
	СнятиеРезервов = (ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв
		Или ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям);
	
	РежимСнятьРезерваПоМножествуДокументов = (ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям);
	
	ТаблицаПомещенияЯчейки = Документы.КорректировкаНазначенияТоваров.ТаблицаПомещенияЯчейкиПоТоварам(ТаблицаТовары.Выгрузить(), КорректировкаНазначения);
	
	СтруктураЗаполнения = Новый Структура("Назначение, Номенклатура, Характеристика, Склад");
	
	КоличествоОстаток = 0;
	
	ЕдиницаИзмерения = Неопределено;
	
	Для Каждого Строка Из ТаблицаПомещенияЯчейки Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Серия) И Не ЗначениеЗаполнено(Строка.Помещение) И Не ЗначениеЗаполнено(Строка.Ячейка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураЗаполнения.Назначение <> Строка.Назначение
			Или СтруктураЗаполнения.Номенклатура <> Строка.Номенклатура
			Или СтруктураЗаполнения.Характеристика <> Строка.Характеристика
			Или СтруктураЗаполнения.Склад <> Строка.Склад Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Строка);
			
			НовыйКорень = ЭлементыДерева.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйКорень, Строка,,"Серия, Помещение, Ячейка, Обеспечено, СвободныйОстаток");
			
			Если Не СнятиеРезервов Тогда
				НовыйКорень.Обеспечено = Строка.СвободныйОстаток;
			КонецЕсли;
			
			НовыйКорень.КоличествоУпаковок = Строка.Количество;
			
			ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "ЕдиницаИзмерения");
			НовыйКорень.Упаковка = ЕдиницаИзмерения;
			
			НовыйКорень.ЭтоКорень = Истина;
			КоличествоОстаток = НовыйКорень.Количество;
			
			СтрокиКорня = НовыйКорень.ПолучитьЭлементы();
			
		КонецЕсли;
		
		Если СнятиеРезервов Тогда
			НовыйКорень.Обеспечено = НовыйКорень.Обеспечено + Строка.Обеспечено;
		КонецЕсли;
		
		Если (КоличествоОстаток > 0 Или Строка.Обеспечено > 0)
			И (ЗначениеЗаполнено(Строка.Серия) Или ЗначениеЗаполнено(Строка.Помещение) Или ЗначениеЗаполнено(Строка.Ячейка)) Тогда
			НоваяВетвь = СтрокиКорня.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяВетвь, Строка, "Номенклатура, Характеристика, Серия, Помещение, Ячейка, Упаковка, Обеспечено, СвободныйОстаток");
			Если НоваяВетвь.Обеспечено > КоличествоОстаток Тогда
				НоваяВетвь.Количество = КоличествоОстаток;
				КоличествоОстаток = 0;
			Иначе
				НоваяВетвь.Количество = НоваяВетвь.Обеспечено;
				КоличествоОстаток = КоличествоОстаток - НоваяВетвь.Обеспечено;
			КонецЕсли;
			
			НоваяВетвь.Обеспечено = Строка.ОбеспеченоУпаковок;
			
			НоваяВетвь.Отметка = НоваяВетвь.Количество > 0;
			
			СтруктураПересчетаЕдиниц = Новый Структура();
			СтруктураПересчетаЕдиниц.Вставить("ПересчитатьКоличествоУпаковок");
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяВетвь, СтруктураПересчетаЕдиниц, Неопределено);

		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоКорней = ЭлементыДерева.Количество() - 1;
	Для Счетчик = 0 По КоличествоКорней Цикл
		Индекс = КоличествоКорней - Счетчик;
		Корень = ЭлементыДерева[Индекс];
		Если Корень.ПолучитьЭлементы().Количество() = 0 Тогда
			ЭлементыДерева.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	СнятиеРезерва = (ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв
		Или ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям);
	
	КонтролироватьПревышениеПотребности = Документы.КорректировкаНазначенияТоваров.КонтролироватьПревышениеПотребностиПоЗаказу(Назначение);
	ТолькоСкладОтгрузки = Не СнятиеРезерва И КонтролироватьПревышениеПотребности;
	СнятьИзлишекРезервов = Не КонтролироватьПревышениеПотребности;
	
	СтруктураЗаполнения = Документы.КорректировкаНазначенияТоваров.ЗаполнитьТаблицуСнятияУстановкиРезервов(ВидОперации, Назначение, Заказ, 
		КорректировкаНазначения, ОтборРезервированияПоСкладуОтгрузки Или ТолькоСкладОтгрузки, ?(ТолькоЗаказыОрганизации, Организация, Неопределено), СнятьИзлишекРезервов);
	Таблица = СтруктураЗаполнения.ТаблицаЗаполненияКорректировки;
	
	ЗаполнитьТаблицуИтогов(СтруктураЗаполнения.ТаблицаИтогов, Таблица);
	ПерезаполнитьКоличествоВТаблицеИтогов(Таблица);
	
	ТаблицаТовары.Загрузить(Таблица);
	
	УстановитьПризнакТребованияПомещенияИЯчейки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИтогов(ТаблицаИтогов, Таблица)
	
	ПараметрыОтбораТоваров = Новый Структура("Назначение, Номенклатура, Характеристика, Склад");
	
	Если ТипЗнч(Таблица) = Тип("ТаблицаЗначений") И Таблица.Колонки.Найти("ИдентификаторСтрокиИтогов") = Неопределено Тогда
		Таблица.Колонки.Добавить("ИдентификаторСтрокиИтогов");
	КонецЕсли;
	
	ИтогиЗаказа.Очистить();
	
	// Подготовка таблицы итогов
	Для Каждого Строка Из ТаблицаИтогов Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбораТоваров, Строка);
		
		НайденныеСтрокиТоваров = Таблица.НайтиСтроки(ПараметрыОтбораТоваров);
		
		Если НайденныеСтрокиТоваров.Количество() = 0 Тогда
			ДобавитьСтрокуТаблицыИтогов(Строка, НайденныеСтрокиТоваров);
		Иначе
			Для Каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
				ДобавитьСтрокуТаблицыИтогов(Строка, НайденныеСтрокиТоваров);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуТаблицыИтогов(ДанныеСтроки, НайденныеСтрокиТоваров)
	
	СтрокаИтогов = ИтогиЗаказа.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаИтогов, ДанныеСтроки);
	
	ИдентификаторСтрокиИтогов = СтрокаИтогов.ПолучитьИдентификатор();
	Для Каждого СтрокаТоваров Из НайденныеСтрокиТоваров Цикл
		СтрокаТоваров.ИдентификаторСтрокиИтогов = ИдентификаторСтрокиИтогов;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьКоличествоВТаблицеИтогов(Таблица = Неопределено)
	
	Сложить = ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.Резервировать
		Или ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать;
		
	Если Не ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		Таблица = ТаблицаТовары;
	КонецЕсли;
		
	Если ТипЗнч(Таблица) = Тип("ТаблицаЗначений") И Таблица.Колонки.Найти("ИдентификаторСтрокиИтогов") = Неопределено Тогда
		Таблица.Колонки.Добавить("ИдентификаторСтрокиИтогов");
	КонецЕсли;
	
	Для Каждого СтрокаИтогов Из ИтогиЗаказа Цикл
		СтрокаИтогов.Количество = 0;
	КонецЦикла;
	
	Для Каждого Строка Из Таблица Цикл
		СтрокаИтогов = ИтогиЗаказа.НайтиПоИдентификатору(Строка.ИдентификаторСтрокиИтогов);
		Если Строка.Отметка Тогда
			ДобавитьВычестьКоличество = ?(Сложить, Строка.Количество, -Строка.Количество);
		Иначе
			ДобавитьВычестьКоличество = 0;
		КонецЕсли;
		СтрокаИтогов.Количество = СтрокаИтогов.Количество + ДобавитьВычестьКоличество;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиПоЗаказу(НазначениеДляИтога)
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Назначение", НазначениеДляИтога);
	
	СтрокиИтогов = ИтогиЗаказа.НайтиСтроки(ПараметрыОтбора);
	
	НеОбеспечен = 0;
	ЧастичноОбеспечено = 0;
	ПолностьюОбеспечен = 0;
	ОбеспеченСверхПотребности = 0;
	
	НетВНаличииНаСкладеОтгрузки = 0;
	ЧастичноВНаличииНаСкладеОтгрузки = 0;
	ПолностьюВНаличииНаСкладеОтгрузки = 0;
	СверхПотребностиВНаличииНаСкладеОтгрузки = 0;
	
	Для Каждого СтрокаИтогов Из СтрокиИтогов Цикл
		
		ОбеспеченоНаВсехСкладах = СтрокаИтогов.Обеспечено + СтрокаИтогов.Количество;
		ВНаличии = СтрокаИтогов.НаСкладе + СтрокаИтогов.Количество;
		Потребность = СтрокаИтогов.Потребность - ОбеспеченоНаВсехСкладах;
		
		// Расчет итогов в целом по заказу
		Если Потребность <= 0 И ОбеспеченоНаВсехСкладах > 0 Тогда
			ПолностьюОбеспечен = ПолностьюОбеспечен + 1;
			Если Потребность < 0 Тогда
				ОбеспеченСверхПотребности = Истина;
			КонецЕсли;
		ИначеЕсли Потребность > 0 И ОбеспеченоНаВсехСкладах > 0 Тогда
			ЧастичноОбеспечено = ЧастичноОбеспечено + 1;
		ИначеЕсли СтрокаИтогов.ПотребностьОсновногоСклада Тогда
			НеОбеспечен = НеОбеспечен + 1;
		КонецЕсли;
		
		Если СтрокаИтогов.ПотребностьОсновногоСклада Тогда
			Если Потребность <= 0
				И СтрокаИтогов.ПотребностьОсновногоСклада Тогда
				ПолностьюВНаличииНаСкладеОтгрузки = ПолностьюВНаличииНаСкладеОтгрузки + 1;
				Если Потребность < 0 Тогда
					СверхПотребностиВНаличииНаСкладеОтгрузки = СверхПотребностиВНаличииНаСкладеОтгрузки + 1;
				КонецЕсли;
			ИначеЕсли ВНаличии > 0
				И СтрокаИтогов.ПотребностьОсновногоСклада Тогда
				ЧастичноВНаличииНаСкладеОтгрузки = ЧастичноВНаличииНаСкладеОтгрузки + 1;
			Иначе
				НетВНаличииНаСкладеОтгрузки = НетВНаличииНаСкладеОтгрузки + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Строковое представление итогов в целом по заказу
	Если НеОбеспечен >= 0 И ЧастичноОбеспечено = 0 И ПолностьюОбеспечен = 0 Тогда
		Элементы.ГруппаСостояние.ТекущаяСтраница = Элементы.ГруппаНеОбеспечено;
	ИначеЕсли ОбеспеченСверхПотребности > 0 И НеОбеспечен = 0 И ЧастичноОбеспечено = 0 Тогда
		Элементы.ГруппаСостояние.ТекущаяСтраница = Элементы.ГруппаОбеспеченСверхПотребности;
	ИначеЕсли ПолностьюОбеспечен > 0 И НеОбеспечен = 0 И ЧастичноОбеспечено = 0 Тогда
		Элементы.ГруппаСостояние.ТекущаяСтраница = Элементы.ГруппаПолностьюОбеспечен;
	Иначе
		Элементы.ГруппаСостояние.ТекущаяСтраница = Элементы.ГруппаОбеспеченЧастично;
	КонецЕсли;
	
	Если НетВНаличииНаСкладеОтгрузки >= 0 И ЧастичноВНаличииНаСкладеОтгрузки = 0 И ПолностьюВНаличииНаСкладеОтгрузки = 0 Тогда
		Элементы.ГруппаВНаличииНаСкладеОтгрузки.ТекущаяСтраница = Элементы.ГруппаНетПозицийНаСкладеОтгрузки;
	ИначеЕсли СверхПотребностиВНаличииНаСкладеОтгрузки > 0 И НетВНаличииНаСкладеОтгрузки = 0 И ЧастичноВНаличииНаСкладеОтгрузки = 0 Тогда
		Элементы.ГруппаВНаличииНаСкладеОтгрузки.ТекущаяСтраница = Элементы.ГруппаСверхПотребностиНаСкладеОтгрузки;
	ИначеЕсли ПолностьюВНаличииНаСкладеОтгрузки > 0 И НетВНаличииНаСкладеОтгрузки = 0 И ЧастичноВНаличииНаСкладеОтгрузки = 0 Тогда
		Элементы.ГруппаВНаличииНаСкладеОтгрузки.ТекущаяСтраница = Элементы.ГруппаПолностьюНаСкладеОтгрузки;
	Иначе
		Элементы.ГруппаВНаличииНаСкладеОтгрузки.ТекущаяСтраница = Элементы.ГруппаЧастичноНаСкладеОтгрузки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьСтроки(Значение)

	Для Каждого СтрокаТоваров Из ТаблицаТовары Цикл
		СтрокаТоваров.Отметка = Значение;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВидОперацииПереключательПриИзмененииНаСервере()
	
	ВидОперации = ?(ВидОперацииПереключатель, ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать"), 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкиНазначения.Резервировать"));
	
	НастроитьЭлементыФормыПриСоздании();
	ЗаполнитьТаблицу();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура РежимПриИзмененииНаСервере()
	ЗаполнитьТаблицу();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Функция ДалееНаСервере()
	
	Перем СтруктураСозданияДокумента;
	
	СтруктураВозврата = Новый Структура("СменаСтраницы", Ложь);
	
	ТребуетсяШаг2 = ТребуетсяШаг2();
	
	Если ТребуетсяШаг2 И Элементы.Шаги.ТекущаяСтраница = Элементы.ШагПоСкладам Тогда
		
		Элементы.Шаги.ТекущаяСтраница = Элементы.ШагПоПомещениямЯчейкам;
		
		ЗаполнитьДерево();
		
		СтруктураВозврата.СменаСтраницы = Истина;
		
	Иначе
		
		ПеренестиДанныеДереваВТаблицу();
		
		Если Параметры.Мастер Тогда
			СтруктураСозданияДокумента = СоздатьДокумент();
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
	СтруктураВозврата.Вставить("СтруктураСозданияДокумента", СтруктураСозданияДокумента);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстРазделителяЗапросов()
	
	Возврат 
	"
	|	
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

#КонецОбласти
